Autodesk.Revit.DB.SpacingRule.BeltMeasurement
On a curved surface, BeltMeasurement specifies where the
grid's distances are measured.
Remarks:
On a conical surface, the distance between the radial gridlines is
not constant. To interpret the Distance property, a circumferential
gridline is taken as the "belt." Distance is then measured along
the belt. The BeltMeasurement property gives the location of the
belt relative to the extremes of the surface. The belt is used
whenever gridlines are not parallel. It defaults to 0.5.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when beltMeasurement is outside the range [ 0.0, 1.0 ].
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the gridlines are guaranteed to be parallel; check the
Autodesk.Revit.DB.SpacingRule.HasBeltMeasurement property before using this property.

Autodesk.Revit.DB.SpacingRule.HasBeltMeasurement
True if the gridlines are not parallel due to surface
curvature, and the BeltMeasurement property therefore
applies.

Autodesk.Revit.DB.SpacingRule.Offset
An additional offset applied to the first
gridline.
Remarks: Measured in feet. Must be between -30000' and
30000'.

Autodesk.Revit.DB.SpacingRule.GridlinesRotation
An additional rotation to be applied
to this set of grid lines.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when
angle is outside of the range ( -PI/2, PI/2 ).

Autodesk.Revit.DB.SpacingRule.Justification
The justification of the lines within
the region.
Remarks: This property is only available when
Autodesk.Revit.DB.SpacingRule.Layout is equal to FixedDistance,
FixedNumber, MaximumSpacing, or MinimumSpacing.

Autodesk.Revit.DB.SpacingRule.Number
The exact number of lines in the
region.
Remarks: This property is only available when
Autodesk.Revit.DB.SpacingRule.Layout is equal to FixedNumber.
Lines will be placed exactly at the boundaries if
possible, so if your region is 100' long and you
specify Number = 11, your lines will be 10'
apart. Must be between 1 and 200.

Autodesk.Revit.DB.SpacingRule.Distance
The exact distance between layout
lines.
Remarks: This property is only available when
Autodesk.Revit.DB.SpacingRule.Layout is equal to FixedDistance,
MaximumSpacing, or MinimumSpacing. Must be a positive
value less than 30000'.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown
when the Autodesk.Revit.DB.SpacingRule.Layout property is None or FixedNumber.

Autodesk.Revit.DB.SpacingRule.SetLayoutMinimumSpacing(System.Double,Autodesk.Revit.DB.SpacingRuleJustification,System.Double,System.Double)
Set the Layout property to MinimumSpacing.
Remarks: When changing the Layout to MinimumSpacing,
you must also simultaneously set the Distance,
Justification, GridlinesRotation, and Offset properties.

Autodesk.Revit.DB.SpacingRule.SetLayoutMaximumSpacing(System.Double,Autodesk.Revit.DB.SpacingRuleJustification,System.Double,System.Double)
Set the Layout property to MaximumSpacing.
Remarks: When changing the Layout to MaximumSpacing,
you must also simultaneously set the Distance,
Justification, GridlinesRotation, and Offset properties.

Autodesk.Revit.DB.SpacingRule.SetLayoutFixedNumber(System.Int32,Autodesk.Revit.DB.SpacingRuleJustification,System.Double,System.Double)
Set the Layout property to FixedNumber.
Remarks: When changing the Layout to FixedNumber,
you must also simultaneously set the Number,
Justification, GridlinesRotation, and Offset properties.

Autodesk.Revit.DB.SpacingRule.SetLayoutFixedDistance(System.Double,Autodesk.Revit.DB.SpacingRuleJustification,System.Double,System.Double)
Set the Layout property to FixedDistance.
Remarks: When changing the Layout to FixedDistance,
you must also simultaneously set the Distance,
Justification, GridlinesRotation, and Offset properties.

Autodesk.Revit.DB.SpacingRule.SetLayoutNone
Set the Layout property to None.
Remarks: No internal lines will be
generated, but the effect is equivalent to having two
lines, one at each end of the region.

Autodesk.Revit.DB.SpacingRule.Layout
A choice of several gridline layout rules.
Remarks: If "None" is chosen, no internal lines will be
generated, but the effect is equivalent to having two
lines, one at each end of the region.

Autodesk.Revit.DB.SpacingRule
A rule for specifying a set of equidistant,
parallel gridlines within a region.